

struct code_string
{
    char* name;
    int lendth;
};

code_string COMMANDS[] = 
                        {
                            "положи в свой никчемный мозг:", 54, //int
                            "я передумал:", 23, 
                            "это", 7, // = 
                            "ломай меня и делай что скажут пока", 63, // while
                            "к сожалению, начнем", 36, //{
                            "ура, закончили", 27, //}
                            "не думай, просто делай, когда тебе скажут:", 76, //function
                            "без лишних слов отдай", 40, //breturn
                            "запихнуть", 19, //input
                            "выпихнуть", 19, //output
                            "сломай меня и сделай это если", 54, //if
                            "не сломал? тогда", 30, //else
                            "<=", 2,
                            ">=", 2,
                            "==", 2,
                            "!=", 2,
                            ">", 1,
                            "<", 1, 
                            "добавъ", 13, //+
                            "убавъ", 11, //-
                            "умножъ", 13, //*
                            "поделиъ", 15, // /
                            "возведиъ", 17, // pow
                            "просинусируйъ", 27, //sin
                            "прокосинусируйъ", 
                        };